import customtkinter
from tkinter import *
from tkinter import filedialog

app = customtkinter.CTk()
app.geometry("800x600")
app.title("Zippy")

# Словарь со всеми возможными символами для русского языка
all_dict = {
    "А": 1, 
    "Б": 2, 
    "В": 3,
    "Г": 4,
    "Д": 5,
    "Е": 6,
    "Ё": 7, 
    "Ж": 8, 
    "З": 9, 
    "И": 10, 
    "Й": 11, 
    "К": 12, 
    "Л": 13, 
    "М": 14, 
    "Н": 15, 
    "О": 16, 
    "П": 17, 
    "Р": 18, 
    "С": 19, 
    "Т": 20, 
    "У": 21, 
    "Ф": 22, 
    "Х": 23, 
    "Ц": 24, 
    "Ч": 25, 
    "Ш": 26, 
    "Щ": 27, 
    "Ъ": 28, 
    "Ы": 29, 
    "Ь": 30, 
    "Э": 31, 
    "Ю": 32,
    "Я": 33,
    "а": 32, 
    "б": 33, 
    "в": 34, 
    "г": 35, 
    "д": 36, 
    "е": 37, 
    "ё": 38,
    "ж": 39, 
    "з": 40, 
    "и": 41, 
    "й": 42, 
    "к": 43, 
    "л": 44, 
    "м": 45, 
    "н": 46, 
    "о": 47, 
    "п": 48, 
    "р": 49, 
    "с": 50, 
    "т": 51, 
    "у": 52, 
    "ф": 53, 
    "х": 54, 
    "ц": 55, 
    "ч": 56, 
    "ш": 57,  
    "щ": 58, 
    "ъ": 59, 
    "ы": 60, 
    "ь": 61, 
    "э": 62, 
    "ю": 63,
    "я": 64,    
    " ": 65,
    ",": 66,
    ".": 67,
    "-": 68,
    "+": 69,
    "/": 70,
    "*": 71,
    "(": 72,
    ")": 73, 
    "{": 74,
    "}": 75,
    "[": 76,
    "]": 77,
    "?": 78,
    "!": 79,
    "@": 80,
    "#": 81,
    "$": 82,
    "%": 83,
    "^": 84,
    "&": 85,
    "№": 86,
    ">": 87,
    "<": 88,
    ":": 89,
    ";": 90,
    "'": 91,
    '"': 92,
    "0": 93,
    "1": 94,
    "2": 95,
    "3": 96,
    "4": 97,
    "5": 98,
    "6": 99,
    "7": 100,
    "8": 101,
    "9": 102,
    "\n": 103,
    "\t": 104
}


def open_file():
    filepath = filedialog.askopenfilename()
    if filepath != "":
        with open(filepath, "r", encoding= "UTF-8") as file: 
            code_str = str(file.read()) # Считываем файл и делаем из него одну строку
            code_list = [] # Список, куда будут записываться символы из тексте (в виде чисел из словаря)
            for i in code_str: # Цикл, который записывает эти числа в список 
                if i in all_dict:
                    code_list.append(all_dict[i])
        with open("coded_text.txt", "w", encoding= "UTF-8") as new_file: 
            new_file.write(*str(code_list))

app.mainloop()
